tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Migemo is a tool that supports Japanese incremental search with Romaji
brew "cmigemo"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# DNS library written in C
brew "ldns"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# GNOME XML library
brew "libxml2"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node@14"
# Development kit for the Java programming language
brew "openjdk"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Password manager
brew "pass"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# YAMAMOTO Mitsuharu's Mac port of GNU Emacs
brew "railwaycat/emacsmacport/emacs-mac"
# Application launcher and productivity software
cask "alfred"
# Two-factor authentication software
cask "authy"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Missing menulet for Homebrew
cask "brewlet"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Trains AIs to understand and translate texts
cask "deepl"
# App to build and share containerized applications and microservices
cask "docker"
# Japanese programming font which is a composed of Hack and GenJyuu-Gothic
cask "font-hackgen"
# Japanese programming font which is a composed of Hack and GenJyuu-Gothic
cask "font-hackgen-nerd"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Interface for reading and syncing eBooks
cask "kindle"
# Native app email client for Gmail
cask "mimestream"
# App to write, plan, collaborate, and get organized
cask "notion"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Editor for designing and documenting APIs
cask "stoplight-studio"
# Keyboard configurator
cask "via"
# Open-source code editor
cask "visual-studio-code"
# JavaScript IDE
cask "webstorm"
# Video communication and virtual meeting platform
cask "zoom"
