tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Emacs dependency management
brew "cask"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# HTTP/2 C Library
brew "nghttp2"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Password manager
brew "pass"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Application launcher and productivity software
cask "alfred"
# Two-factor authentication software
cask "authy"
# Missing menulet for Homebrew
cask "brewlet"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Trains AIs to understand and translate texts
cask "deepl"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Interface for reading and syncing eBooks
cask "kindle"
# Native app email client for Gmail
cask "mimestream"
# App to write, plan, collaborate, and get organized
cask "notion"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Editor for designing and documenting APIs
cask "stoplight-studio"
# Open-source code editor
cask "visual-studio-code"
