tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "railwaycat/emacsmacport"
# Library for manipulating PNG images
brew "libpng"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs", link: false
# Emacs dependency management
brew "cask"
# Dependency Manager for PHP
brew "composer"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# HTTP/2 C Library
brew "nghttp2"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Password manager
brew "pass"
# General-purpose scripting language
brew "php@8.0"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# YAMAMOTO Mitsuharu's Mac port of GNU Emacs
brew "railwaycat/emacsmacport/emacs-mac"
# Application launcher and productivity software
cask "alfred"
# Two-factor authentication software
cask "authy"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Trains AIs to understand and translate texts
cask "deepl"
# App to build and share containerized applications and microservices
cask "docker"
# Japanese programming font which is a composed of Hack and GenJyuu-Gothic
cask "font-hackgen"
# Japanese programming font which is a composed of Hack and GenJyuu-Gothic
cask "font-hackgen-nerd"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Interface for reading and syncing eBooks
cask "kindle"
# Native app email client for Gmail
cask "mimestream"
# App to write, plan, collaborate, and get organized
cask "notion"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Editor for designing and documenting APIs
cask "stoplight-studio"
cask "via"
# Open-source code editor
cask "visual-studio-code"
# JavaScript IDE
cask "webstorm"
